export const regText = {
    hello_text1: 'Привет! Это верный адрес, отсюда начинается твоё будущее в профессиональных информационных технологиях.',
    hello_text2: 'Давай знакомиться:',
    where_you_study: 'Где ты учишься?',
    button_to_hand_stduy: 'Добавить вручную',
    button_to_auto_study: 'Вернуться к списку',
    warning_about_fake_study: 'Если будет указано несуществующее учебное заведение, то мы оставляем за собой право удалить зарегистрированный аккаунт.',
    run_to_finaly: 'Почти готово',
    about_auto_reg: 'Возникли проблемы при регистрации? Заполни все необходимые поля, и мы сами зарегистрируем тебя!',
    // label_about_personal_data: 'Согласен на обработку своих персональных данных в соответствии с Федеральным законом Российской Федерации от 27 июля 2006 года № 152-ФЗ "О персональных данных", а также информирование для участия в цифровых студенческих мероприятиях с использованием платформы "Новый шаг".',
    personal_data_about: 'Подтверждаю свое согласие с условиями ',
    personal_data_link: 'обработки персональных данных.',
    error_fill_all_fields: '<h5 class="text-center py-5">Заполни все поля!</h5></h5>',
    auto_reg_request_ok: `<h5 class="text-center py-5">Заявка на регистрацию отправлена. Мы зарегистрируем тебя в течении недели. На почту придет 2 письма: одно с ссылкой для подтверждения аккаунта, второе с паролем для входа.</h5>`,
    auto_reg_request_fail: `<h5 class="text-center py-5">Не удалось отправить заявку на регистрацию. Возможны неполадки на сервере, попробуй позднее.</h5>`,
    dont_confirm_pass: 'Не верно повторен пароль',
    edu_report_ok: `<h5 class="text-center py-5">Заявка на добавление учебного заведения отправлена. После модерации твое учебное заведение отобразиться в личном кабинете.</h5>`,
    edu_report_fail: `<h5 class="text-center py-5">Не удалось отправить заявку на добавление учебного заведения. После авторизации перейди в личный кабинет -> "Добавить учебное заведение".</h5>`,
    register_ok: `<h5 class="text-center py-5">Регистрация аккаунта прошла успешно. Тебе на почту пришло письмо с ссылкой для активации аккаунта. После этого ты сможешь авторизоваться.</h5>`,
    header_reg_fail: '<h5 class="mb-3 text-center">Необходимо исправить следующие ошибки:</h5><ul>',
    dont_find_inst1: 'Учебных заведений с данным типом нет в нашей базе данных. <br> Нажми "Добавить вручную".',
    dont_find_inst2: 'Учебных заведений с данным типом нет в нашей базе данных. <br> Перейди на форму обратной связи и оставь данные о своем учебном заведении.',
    password_ruls: `Длина пароля не менее 8 символов
Пароль не должен быть слишком распространенным
Пароль должен содержать как минимум одну: 
    цифру
    букву в верхнем регистре
    букву в нижнем регистре`,
    password_ruls_html: `<ul class="text-blue"><li>Длина пароля не менее 8 символов</li><li>Пароль не должен быть слишком распространенным</li><li>Пароль должен содержать как минимум одну: <ul><li>цифру</li><li>букву в верхнем регистре</li><li>букву в нижнем регистре</li></ul></li></ul>`,
    backStep1: 'Назад',
    backStep2: 'Ручная регистрация',
    nextStep1: 'Следующий шаг',
    nextStep2: 'Вернуться к стандартной регистрации',
    about_backStep2: 'Возникли проблемы при регистрации?',
    login: 'Войти',
    about_login: 'Уже есть аккаунт?',
    button_reg: 'Зарегистрироваться'
};