<template>
    <div class='container col-sm-8'>
        <p>Платформа профессионального развития «Новый шаг» создана с целью формирования необходимых профессионалу навыков и
            реализации проектной деятельности.</p>

        <p>Каждый участник получает возможность оценить уровень своего профессионального развития, реализовать его цели, а
            также получить экспертную поддержку и взаимодействие с коллегами.</p>

        <p class="fs-6 text-primary"><em>Смелый шаг в хорошей компании.</em></p>

        <p>Свой первый осознанный шаг ты сделал, выбрав самую крутую специальность. Настоящая смелость – это двигаться
            дальше и
            продолжать развитие в выбранном направлении. Теперь можно не бояться выбора – есть
            <a class="text-dark" href="">много хороших людей</a>, которые точно знают, как стать настоящим.
        </p>

        <p>Выходом колоссальной созидательной энергии, создаваемой инициативами, проектными работами, усилиями по
            саморазвитию активной части студенчества во взаимодействии с экспертами, становятся регулярные мероприятия.</p>
        <p>Например, в текущем году это соревнования и чемпионаты, призванные сфокусировать усилия участников, распределить
            эту активность для чёткого, в моменте, выхода "на результат". Такой подход позволяет не только использовать
            положительные стороны состязательного подхода, но также даёт возможность объективного и предметного рассмотрения
            проектов судейской комиссией.</p>

    </div>
</template>

<script>
export default {
    data() {
        return {

        }
    },
    components: {

    },
    methods: {

    },
    created() {
        this.$store.commit('routes/toMainPage')
    }
}
</script>

<style scoped></style>