<template>
    <div class='col-lg-8 col-11 mx-auto'>
        <h5 class="text-center mx-auto mb-3">РЕГЛАМЕНТ<br>
            проведения Чемпионата Тверской области<br>
            по спортивному программированию<br>
            6-7 ноября 2023 года
        </h5>
        <p>Дисциплина: <em>Продуктовое программирование</em><br>
            Тематика: <em>Информационная безопасность</em>
        </p>
        <p>
            К участию допускаются студенты среднеспециальных и высших учебных заведений, достигшие 14 лет на момент
            регистрации.
        </p>
        <p>Состав сборной команды: <em>от 3 до 5 человек.</em> </p>
        <!-- <p>
            Регистрация участников команды осуществляется через платформу "Новый шаг" мероприятия «Хакатон»  В срок до 30 октября капитану команды необходимо в личном кабинете сформировать команду (адрес кнопки) и отправить приглашение другим членам команды. Альтернативной формой регистрации может считаться Заявка на участие по установленному шаблону (адрес веб-формы и кнопки «Отправить заявку»).
        </p> -->
        <!-- ПОПРАВЛЕНО -->
        <p>
            Регистрация участников команды осуществляется через платформу "Новый шаг" мероприятия «Хакатон» <em>В срок до 30
                октября капитану команды необходимо сформировать команду</em> (кнопка "Создать команду" на странице
            мероприятия
            <a href="https://nwstep.ru/hackathon" target="_blank">https://nwstep.ru/hackathon</a>) и отправить приглашение
            другим членам команды.
        </p>
        <p>
            В ходе соревнования участники должны реализовать работоспособный программный комплекс, который решает
            продуктовую задачу по тематике хакатона, и провести презентацию готового решения.
        </p>
        <p>
            6 ноября 2023 года участникам необходимо до 8:30 прибыть по адресу <a class="text-dark" target="_blank"
                href="https://yandex.ru/maps/14/tver/house/prospekt_nikolaya_korytkova_3b/Z0wYfgZnTUIDQFtsfXR1d3xrYg==/?ll=35.817475%2C56.846086&z=16">г.
                Тверь, проспект Николая Корыткова, д. 3б</a>,
            помещение № 247 (9-этажный корпус, остановка общественного транспорта «НПО «Центрпрограммсистем»).
        </p>
        <p>
            Участники должны иметь при себе <em>паспорт и медицинский полиc.</em>
        </p>
        <p>
            Участие в хакатоне предусмотрено <em>со своим ноутбуком</em>. <br>Участник сам контролирует работоспособность и
            возможность
            реализации поставленных задач, а также безопасность применения своей техники, в частности, антивирусную защиту.
        </p>

        <h4 class="mb-3 mx-auto text-center">Расписание проведения хакатона</h4>
        <div class="mb-4">
            <div class="mb-3 p-2 border border-primary rounded">
                <h5 class="text-center">06.11.2023</h5>
                <ul>
                    <li class="mb-1">
                        09:00-10:00. Допуск участников (команд). Заседание главной судейской коллегии.
                    </li>
                    <li class="mb-1">
                        10:00-10:20. Церемония открытия соревнования.
                    </li>
                    <li class="mb-1">
                        10:20-10:40. Общее собрание-инструктаж участников соревнования. Объявляется задача и разъясняются
                        правила проведения соревнования.
                    </li>
                    <li class="mb-1">
                        11:00-21:00. Квалификационный раунд 1. Участники решают продуктовую задачу.
                    </li>
                    <li class="mb-1">
                        21:30. Закрытие соревновательной площадки
                    </li>
                </ul>
            </div>
            <div class="mb-3 p-2 border border-primary rounded">
                <h5 class="text-center">07.11.2023</h5>
                <ul>
                    <li class="mb-1">
                        09:00-15:00. Квалификационный раунд 2. Участники продолжают решать продуктовую задачу.
                    </li>
                    <li class="mb-1">
                        15:00-19:00. Решение жюри в составе из трех судей-экспертов о допуске 50-70% команд в финальный
                        раунд.
                    </li>
                    <li class="mb-1">
                        19:00-21:00. Финальный раунд. Защита проектов (презентация) и подведение итогов жюри.
                    </li>
                    <li class="mb-1">
                        21:00-21:30. Торжественное закрытие мероприятия. Награждение победителей и призеров.
                    </li>
                </ul>
            </div>
        </div>

        <h4 class="mb-3 mx-auto text-center">Критерии, по которым будет проводиться оценка:</h4>
        <p>
            а) для допуска в финальный раунд – архитектура решения, структура данных, оценка кода, готовность решения –
            фронтенда и бекенда;
        </p>
        <p>
            б) для определения победителя и призеров соревнований – работоспособность прототипа, соответствие функциональным
            требованиям, технологичность, презентация, потенциал.
        </p>

        <h4 class="mb-3 mx-auto text-center"> Формат проведения:</h4>
        <p>Для участия в соревнованиях участники используют <em>свои ноутбуки</em>. До завершения мероприятия ноутбуки
            <em>нельзя
                выносить с площадки соревнований, в том числе во время перерыва между квалификационными раундами на
                ночь.</em>
            Участникам выделяются отдельные запирающиеся ячейки, в которые можно разместить личные вещи.
        </p>
        <p>Организаторы предоставляют доступ в интернет на площадке соревнований. Размещение команд за рабочими местами –
            произвольно. Для предотвращения недобросовестного поведения судейская комиссия будет производить наблюдение за
            участниками, в том числе в помещении, где будет происходить Конкурс, организовано видеонаблюдение. </p>
        <p>Все коллизии могут быть просмотрены по логам системы и с использованием видеозаписей, решение судейской комиссии
            может быть пересмотрено в течение 24-х часов с момента окончания мероприятия.</p>

        <h4 class="mb-3 mx-auto text-center">Награждение победителей:</h4>
        <p>Победителями считаются участники, набравшие наибольшее количество баллов, решение объявляется судейской
            коллегией.</p>

        <p>Участники команд, завоевавшие первые три места, награждаются медалями. Победившая команда получает кубок
            Хакатона.</p>



    </div>
</template>

<script>
export default {
    data() {
        return {

        }
    },
    components: {

    },
    methods: {

    }
}
</script>

<style scoped></style>