<template>
  <div class="container">
    <div class="row d-flex justify-content-between">
      <div class="col">
        <h1 class="fs-3 text-center mb-1">Положение</h1>
        <p class="fs-6 text-center mb-2">О конкурсе информационных технологий</p>
        <h3 class="fs-5 mb-2 mb-lg-2">1. Общие положения</h3>
        <div class="ms-lg-4">
          <p class="fs-6 mb-1">
            1.1. <em>Студенческий фестиваль ИТ-профессий «Новый шаг-2023»</em> (далее – Конкурс)
            является мероприятием, проводимым среди студентов для определения наиболее подготовленных
            к выполнению практических задач в области информационных технологий:
          </p>
          <ul class="mb-1">
            <li class="mb-1">
              Знания и умения участников в области программирования и смежных областей;
            </li>
            <li class="mb-1">
              Навыки командной работы и сотрудничества (эффективность коммуникации,
              разделение задач, координация и др.);
            </li>
            <li class="mb-1">
              Способность участников предлагать новые идеи, находить нестандартные решения
              и применять их в решении задач;
            </li>
            <li class="mb-1">
              Способность участников анализировать и решать сложные задачи, эффективно
              использовать доступные ресурсы и быстро принимать ключевые решения;
            </li>
            <li class="mb-1">
              Умение участников ясно и доходчиво представлять результаты своей работы,
              включая демонстрацию проектов, отчетов и коммуникацию с членами жюри и другими участниками;
            </li>
            <li class="mb-1">
              Практическое применение знаний и умений участников в реальных ситуациях, их способность адаптироваться к
              новым требованиям.
            </li>
          </ul>
          <p class="fs-6 mb-1">
            Участие в Конкурсе для студентов - бесплатное.
          </p>
          <p class="fs-6 mb-1">
            1.2. Учредителем и главным организатором Конкурса (далее – Организатор)
            является Акционерное общество «Научно-исследовательский институт «Центрпрограммсистем».
          </p>
          <div class="ms-4">
            <p class="fs-6 mb-1">
              1.2.1. Реквизиты Организатора:<br>
              Почтовый адрес и адрес фактического местоположения:<br>
              <em>170024, г. Тверь, проспект Николая Корыткова, дом 3а;</em><br>
              Для командировочных удостоверений указывать:<br>
              Акционерное общество «Научно-исследовательский институт «Центрпрограммсистем» (АО НИИ ЦПС), г. Тверь;<br>
              Финансовые реквизиты:<br>
              ИНН/КПП: 6904008332/695001001<br>
              р/с 40702810863070100221 в Тверском отделении №8607 ПАО СБЕРБАНК г. ТВЕРЬ<br>
              к/с 30101810700000000679, БИК 042809679
            </p>
          </div>
          <p class="fs-6 mb-1">
            1.3. Организатор определяет дату проведения, направления, по которым будет проводиться
            соревнование, обеспечивает информационное обеспечение, регистрацию
            участников и реализует проведение Конкурса.
          </p>
          <p class="fs-6 mb-1">
            1.4. Расписание проведения Конкурса, информация о зарегистрированных участниках и
            итогах проведения публикуется на сайте конкурса «Новый Шаг».
          </p>
          <p class="fs-6 mb-1">
            1.5. Не позднее 60 дней до проведения мероприятия, Организатор объявляет направления, по которым будет
            проводиться соревнование.
          </p>
        </div>
        <!--!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!ЗДЕСЬ ВТОРОЙ ПУНКТ ПОЛОЖЕНИЯ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!-->
        <h3 class="fs-5 mt-3 mb-2 mt-lg-2 mb-lg-2">2. Регистрация участников</h3>
        <div class="ms-lg-4">
          <p class="fs-6 mb-1">
            2.1. К участию допускаются студенты (команды), прошедшие предварительную
            регистрацию и согласие на обработку персональных данных через веб-форму по адресу:
            <a href="https://nshag.ru" class="text-primary">www.nshag.ru</a> и получившие извещение о регистрации.
            Ограничения по возрасту участников,
            специализации и прочие устанавливаются Регламентом мероприятия.
          </p>
          <p class="fs-6 mb-1">
            2.2. В случае, если Конкурс включает несколько мероприятий, или мероприятия длительного
            характера (например, участие в хакатоне и т.п.), участнику следует соотнести свои
            силы и возможности, исключить дублирование и тщательно продумать логистику и
            транспортные вопросы при любом исходе соревнования.
          </p>
        </div>
        <!--!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!ЗДЕСЬ ТРЕТИЙ ПУНКТ ПОЛОЖЕНИЯ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!-->
        <h3 class="fs-5 mt-3 mb-2 mt-lg-2 mb-lg-2">3. Порядок проведения</h3>
        <div class="ms-lg-4">
          <p class="fs-6 mb-1">
            3.1. Зарегистрированные пользователи получают в своём личном кабинете инструкцию
            о времени и месте проведения мероприятия, при необходимости – о порядке очередности и режиме мероприятия.
          </p>
          <p class="fs-6 mb-1">
            3.2. Организатор обеспечивает все необходимые условия для проведения Конкурса,
            включая горячие напитки, закуски для участников, а также места отдыха для
            участников длительных соревнований.
          </p>
          <p class="fs-6 mb-1">
            3.3. В ряде случаев, когда это напрямую указано в регламенте (например, участие в хакатоне и т.п.),
            допустимо использовать персональные компьютеры участников. В остальных случаях
            <em>использование персональных устройств не допускается.</em>
          </p>
          <p class="fs-6 mb-1">
            3.4. Непосредственное проведение Конкурса регулируется Регламентом,
            публикуемым на странице мероприятия не позднее 7 дней от даты первого мероприятия.
          </p>
          <p class="fs-6 mb-1">
            3.5. При проведении Конкурса важную роль в достижении успеха играют положительная
            атмосфера и взаимодействие. Присутствующим следует активно принимать участие во всех
            аспектах чемпионата, а также поддерживать коллег, т.е. стремиться к позитивному, безопасному и
            справедливому общению и соблюдать установленные <u>Правила поведения</u>:
          </p>
          <div class="ms-4">
            <p class="fs-6 mb-1">
              3.5.1. Участники должны относиться друг к другу с уважением. Запрещено использование
              оскорблений, угроз и ненормативной лексики.
            </p>
            <p class="fs-6 mb-1">
              3.5.2. Все участники должны соблюдать правила Конкурса и выполнять свои задания честно.
              Попытки мошенничества или использования запрещенных программ запрещены.
            </p>
            <p class="fs-6 mb-1">
              3.5.3. При работе в формате командных соревнований важно соблюдать продуктивное
              взаимодействие внутри команды.
            </p>
            <p class="fs-6 mb-1">
              3.5.4. Участники должны соблюдать все необходимые правила безопасности и быть ответственными
              при использовании оборудования, программного обеспечения и данных.
            </p>
            <p class="fs-6 mb-1">
              3.5.5. Участники не должны копировать или представлять работы других участников как свои собственные.
            </p>
            <p class="fs-6 mb-1">
              3.5.6. Участники должны придерживаться установленных временных рамок для представления своих работ или
              решений задач.
            </p>
          </div>
        </div>
        <!--!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!ЗДЕСЬ ЧЕТВЁРТЫЙ ПУНКТ ПОЛОЖЕНИЯ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!-->
        <h3 class="fs-5 mt-3 mb-2 mt-lg-2 mb-lg-2">4. Порядок оценивания и награждение победителей</h3>
        <div class="ms-lg-4">
          <p class="fs-6 mb-1">
            4.1. Оценка решений участников производится судейской комиссией, которая включает
            представителей Организатора, вузов и других квалифицированных лиц. Информация о
            комиссии публикуется в числе информации о мероприятии непосредственно в день его проведения.
          </p>
          <p class="fs-6 mb-1">
            4.2. Начисление баллов по каждой конкурсной дисциплине и направлению, а также призовой
            фонд определяются Регламентом, публикуемым на странице мероприятия.
          </p>
          <p class="fs-6 mb-1">
            4.3. Итоги Конкурса и награждение победителей осуществляются не позднее срока, определенного
            Регламентом с момента окончания мероприятия.
          </p>
        </div>
        <!--!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!ЗДЕСЬ ПЯТЫЙ ПУНКТ ПОЛОЖЕНИЯ!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!-->
        <h3 class="fs-5 mt-3 mb-2 mt-lg-2 mb-lg-2">5. Правовая информация</h3>
        <div class="ms-lg-4">
          <p class="fs-6 mb-1">
            5.1. Организатор является оператором персональных данных, а также налоговым агентом
            для победителей и принимает на себя соответствующие обязательства.
          </p>
          <p class="fs-6 mb-1">
            5.2. Все результаты интеллектуальной деятельности, медиа-материалы, полученные в
            результате Конкурса, могут использоваться Организатором по своему усмотрению.
          </p>
          <p class="fs-6 mb-1">
            5.3. Все претензии, запросы по ошибкам системы регистрации или системы
            проведения Конкурса следует направлять на адрес электронной почты <em>audit@cps.tver.ru</em>
          </p>
          <p class="fs-6 mb-1">
            5.4. Все возникающие коллизии рассматриваются Организатором не позднее 24-х часов после
            срока окончания, указанного в Регламенте мероприятия.
          </p>
        </div>
      </div>
    </div>
  </div>
</template>

<script>
export default {
  created() {
    this.$store.commit('routes/toMainPage')
  }
}
</script>

<style scoped></style>